# ElementId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkLoadResult..::..ElementId Property
LinkLoadResult Class See Also
---
The id of the created or loaded linked model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId ElementId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ElementId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ElementId {
	ElementId^ get ();
}
```

# Remarks
This may be invalidElementId if there were errors (for example, LinkLoadResultType.SameModelAsHost causes no link to be created).
# See Also
LinkLoadResult Class
Autodesk.Revit.DB Namespace